Revit 2027 API
FamilyItemFactory.NewSweptBlend(Boolean, Reference, SweepProfile, SweepProfile) Method
Adds a new swept blend into the family document, using a selected reference as the path.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SweptBlend NewSweptBlend(
	bool isSolid,
	Reference path,
	SweepProfile bottomProfile,
	SweepProfile topProfile
)
Public Function NewSweptBlend (
	isSolid As Boolean,
	path As Reference,
	bottomProfile As SweepProfile,
	topProfile As SweepProfile
) As SweptBlend
public:
SweptBlend^ NewSweptBlend(
	bool isSolid,
	Reference^ path,
	SweepProfile^ bottomProfile,
	SweepProfile^ topProfile
)
member NewSweptBlend :
        isSolid : bool *
        path : Reference *
        bottomProfile : SweepProfile *
        topProfile : SweepProfile -> SweptBlend
Parameters
isSolid Boolean
Indicates if the swept blend is Solid or Void.
path Reference
The path of the swept blend. The path might be a reference of single curve or edge obtained from existing geometry. Or the path can be a single sketched curve, and the curve is not required to reference existing geometry.
bottomProfile SweepProfile
The bottom profile of the newly created Swept blend. It should consist of only one curve loop. the input profile must be in one plane.
topProfile SweepProfile
The top profile of the newly created Swept blend. It should consist of only one curve loop. The profile must lie in the XY plane, and it will be transformed to the profile plane automatically.
Return Value
SweptBlend
If creation was successful the new Swept blend is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input arguments-path/bottomProfile/topProfile-are null.
ArgumentException |  Thrown when the input argument-bottomProfile/topProfile-is a curve based profile and the profile is null.
ArgumentException |  Thrown when the input argument-bottomProfile/topProfile-is a curve based profile and the profile contains null or more than one curve loops.
ArgumentException |  Thrown when the input argument-bottomProfile/topProfile-is a family symbol based profile and the family symbol profile is null.
InvalidOperationException |  Thrown when the creation failed.
Remarks
This method creates a swept blend in a family document. The swept blend will trace from bottom profile to the top along the path. Revit will determine an appropriate default mapping for the vertices of the two profiles. If the input profile is to be a cyclic profile (curve or ellipse) it must be split into at least two segments, so that Revit can find vertices to use for mapping the swept blend.
See Also
Reference
FamilyItemFactory Class
NewSweptBlend Overload
Autodesk.Revit.Creation Namespace